Revit 2027 API
MEPNetworkSegmentId Constructor
 Creates a default invalid segment id on the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentId()
Public Sub New
public:
MEPNetworkSegmentId()
new : unit -> MEPNetworkSegmentId
See Also
Reference
MEPNetworkSegmentId Class
MEPNetworkSegmentId Overload
Autodesk.Revit.DB.Analysis Namespace